Reports/ВедомостьДляКонтролеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>ВедомостьДляКонтролеров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ПоверкиПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоверкиПриборовУчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоверкаВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовЗаМесяц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовЗаМесяц</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоказаниеПредыдущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НачислениеПоСреднему</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ВедомостьДляКонтролеров/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьОтчетНаСервере1(ТабДок)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет,
	    |	РасчетыПоЛицевымСчетамОбороты.Услуга,
	    |	РасчетыПоЛицевымСчетамОбороты.МесяцНачисления,
	    |	РасчетыПоЛицевымСчетамОбороты.СуммаПриход КАК Начисления
	    |ПОМЕСТИТЬ Обороты
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты(
	    |			,
	    |			,
	    |			Месяц,
	    |			МесяцНачисления = &МесяцНачисления
	    |				И ЛицевойСчет.Владелец.Наименование ПОДОБНО ""%"" + &Наименование + ""%"") КАК РасчетыПоЛицевымСчетамОбороты
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.МесяцНачисления,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход
	    |ПОМЕСТИТЬ Оплата
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Месяц, , ЛицевойСчет.Владелец.Наименование ПОДОБНО ""%"" + &Наименование + ""%"") КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
	    |	РасчетыПоЛицевымСчетамОстатки.Услуга,
	    |	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления,
	    |	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток КАК Остаток
	    |ПОМЕСТИТЬ Остатки
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(&НачалоПериода, ЛицевойСчет.Владелец.Наименование ПОДОБНО ""%"" + &Наименование + ""%"") КАК РасчетыПоЛицевымСчетамОстатки
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Владелец КАК Здание,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета КАК Квартира,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.МобТелефон КАК МобТелефон,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ПарольДоступа КАК ПарольДоступа,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Бойлер КАК НаличиеБойлера,
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.НеЖивут КАК НеЖивут,
	    |	ЛицевыеСчетаСрезПоследних.КоличествоПрописанных,
	    |	ЛицевыеСчетаСрезПоследних.КоличествоПроживающих,
	    |	ПоверкиПриборовУчетаСрезПоследних.ПриборУчета,
	    |	ПоверкиПриборовУчетаСрезПоследних.Период КАК ДатаПоверки,
	    |	ПоказанияПриборовУчетаСрезПоследних.Значение КАК Показания
	    |ПОМЕСТИТЬ ЛицевыеСчетаПриборы
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(
	    |			&НаДату,
	    |			ЛицевойСчет.Владелец.Наименование ПОДОБНО ""%"" + &Наименование + ""%""
	    |				И Действует = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоверкиПриборовУчета.СрезПоследних(&НаДату, ОбъектУстановки.Владелец.Наименование ПОДОБНО ""%"" + &Наименование + ""%"") КАК ПоверкиПриборовУчетаСрезПоследних
	    |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&НаДату, ) КАК ПоказанияПриборовУчетаСрезПоследних
	    |			ПО ПоверкиПриборовУчетаСрезПоследних.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета
	    |		ПО ЛицевыеСчетаСрезПоследних.ЛицевойСчет = ПоверкиПриборовУчетаСрезПоследних.ОбъектУстановки
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	ЛицевыеСчетаПриборы.Здание,
	    |	ЛицевыеСчетаПриборы.ЛицевойСчет,
	    |	ЛицевыеСчетаПриборы.Квартира,
	    |	ЛицевыеСчетаПриборы.МобТелефон,
	    |	ЛицевыеСчетаПриборы.ПарольДоступа,
	    |	ЛицевыеСчетаПриборы.НаличиеБойлера,
	    |	ЛицевыеСчетаПриборы.НеЖивут,
	    |	ЛицевыеСчетаПриборы.КоличествоПрописанных,
	    |	ЛицевыеСчетаПриборы.КоличествоПроживающих,
	    |	ЛицевыеСчетаПриборы.ПриборУчета,
	    |	ЛицевыеСчетаПриборы.ДатаПоверки,
	    |	ЛицевыеСчетаПриборы.Показания,
	    |	Обороты.Услуга,
	    |	Обороты.МесяцНачисления,
	    |	Обороты.Начисления КАК Начислено,
	    |	Оплата.СуммаРасход КАК Оплачено,
	    |	Остатки.Остаток
	    |ИЗ
	    |	ЛицевыеСчетаПриборы КАК ЛицевыеСчетаПриборы
	    |		ЛЕВОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
	    |		ПО ЛицевыеСчетаПриборы.ЛицевойСчет = Обороты.ЛицевойСчет
	    |		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	    |		ПО ЛицевыеСчетаПриборы.ЛицевойСчет = Остатки.ЛицевойСчет
	    |		ЛЕВОЕ СОЕДИНЕНИЕ Оплата КАК Оплата
	    |		ПО ЛицевыеСчетаПриборы.ЛицевойСчет = Оплата.ЛицевойСчет";
	Запрос.УстановитьПараметр("НачалоПериода", Отчет.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.КонецПериода));
	Запрос.УстановитьПараметр("НаДату", Отчет.НачалоПериода);
	Запрос.УстановитьПараметр("МесяцНачисления", ДобавитьМесяц(НачалоМесяца(Отчет.НачалоПериода), - 1));
	Запрос.УстановитьПараметр("Наименование", Отчет.Адрес);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!
	
	Макет = Отчеты.ВедомостьДляКонтролеров.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДляПечати.Здание,
		|	ДляПечати.ЛицевойСчет,
		|	ДляПечати.Квартира,
		|	ДляПечати.МобТелефон,
		|	ДляПечати.ПарольДоступа,
		|	ДляПечати.КоличествоПрописанных,
		|	ДляПечати.КоличествоПроживающих,
		|	ДляПечати.НаличиеБойлера,
		|	ДляПечати.НеЖивут,
		|	ДляПечати.ПриборУчета,
		|	ДляПечати.Показания,
		|	ДляПечати.ДатаПоверки,
		|	ДляПечати.Услуга,
		|	ДляПечати.МесяцНачисления,
		|	ДляПечати.Начислено,
		|	ДляПечати.Оплачено,
		|	ДляПечати.Остаток
		|ПОМЕСТИТЬ втДляПечати
		|ИЗ
		|	&ДляПечати КАК ДляПечати
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДляПечати.Здание КАК Здание,
		|	втДляПечати.ЛицевойСчет КАК ЛицевойСчет,
		|	втДляПечати.Квартира,
		|	втДляПечати.МобТелефон,
		|	втДляПечати.ПарольДоступа,
		|	втДляПечати.КоличествоПрописанных,
		|	втДляПечати.КоличествоПроживающих,
		|	втДляПечати.НаличиеБойлера,
		|	втДляПечати.НеЖивут,
		|	втДляПечати.ПриборУчета,
		|	втДляПечати.Показания,
		|	втДляПечати.ДатаПоверки,
		|	втДляПечати.Услуга,
		|	втДляПечати.МесяцНачисления,
		|	СУММА(втДляПечати.Начислено) КАК Начислено,
		|	СУММА(втДляПечати.Оплачено) КАК Оплачено,
		|	СУММА(втДляПечати.Остаток) КАК Остаток
		|ИЗ
		|	втДляПечати КАК втДляПечати
		|
		|СГРУППИРОВАТЬ ПО
		|	втДляПечати.Здание,
		|	втДляПечати.ЛицевойСчет,
		|	втДляПечати.Квартира,
		|	втДляПечати.МобТелефон,
		|	втДляПечати.ПарольДоступа,
		|	втДляПечати.КоличествоПрописанных,
		|	втДляПечати.КоличествоПроживающих,
		|	втДляПечати.НаличиеБойлера,
		|	втДляПечати.НеЖивут,
		|	втДляПечати.ПриборУчета,
		|	втДляПечати.Показания,
		|	втДляПечати.ДатаПоверки,
		|	втДляПечати.Услуга,
		|	втДляПечати.МесяцНачисления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Здание,
		|	ЛицевойСчет
		|ИТОГИ
		|	СУММА(Начислено),
		|	СУММА(Оплачено),
		|	СУММА(Остаток)
		|ПО
		|	Здание,
		|	ЛицевойСчет
		|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ДляПечати", РезультатЗапроса);
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ДатаПроверки = Отчет.НачалоПериода;
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьЗдание = Макет.ПолучитьОбласть("Здание");
	ОбластьЛицевойСчет = Макет.ПолучитьОбласть("ЛицевойСчет");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаЗдание = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗдание.Следующий() Цикл
		ОбластьЗдание.Параметры.Заполнить(ВыборкаЗдание);
		ТабДок.Вывести(ОбластьЗдание, ВыборкаЗдание.Уровень());
	
		ВыборкаЛицевойСчет = ВыборкаЗдание.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаЛицевойСчет.Следующий() Цикл
			ОбластьЛицевойСчет.Параметры.Заполнить(ВыборкаЛицевойСчет);
			ТабДок.Вывести(ОбластьЛицевойСчет, ВыборкаЛицевойСчет.Уровень());
	
			ВыборкаДетальныеЗаписи = ВыборкаЛицевойСчет.Выбрать();
	
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
				ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере(ТабДок)
	//тзДанныеЛС = Новый ТаблицаЗначений;
	//тзДанныеЛС.Колонки.Добавить("ЛицевойСчет");
	//тзДанныеЛС.Колонки.Добавить("Адрес");
	//тзДанныеЛС.Колонки.Добавить("Квартира");
	//тзДанныеЛС.Колонки.Добавить("ФИО");
	//тзДанныеЛС.Колонки.Добавить("Телефон");
	//тзДанныеЛС.Колонки.Добавить("КвоПрописанных");
	//тзДанныеЛС.Колонки.Добавить("КвоПроживающих");
	//тзДанныеЛС.Колонки.Добавить("Бойлер");
	//тзДанныеЛС.Колонки.Добавить("НеЖивут");
	//тзДанныеЛС.Колонки.Добавить("Услуга");
	//тзДанныеЛС.Колонки.Добавить("ПриборУчета");
	//тзДанныеЛС.Колонки.Добавить("Показания");
	//тзДанныеЛС.Колонки.Добавить("ДатаПоверки");
	//тзДанныеЛС.Колонки.Добавить("МесяцНачисления");
	//тзДанныеЛС.Колонки.Добавить("Начислено");
	//тзДанныеЛС.Колонки.Добавить("Оплачено");
	//тзДанныеЛС.Колонки.Добавить("Остаток");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.Здание КАК Здание,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ОбъектЛицевогоСчета,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ОтветственныйВладелец КАК ОтветственныйВладелец,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ЛицевойСчет.МобТелефон,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ЛицевойСчет.Бойлер,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ЛицевойСчет.НеЖивут,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ПриборУчета,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ПриборУчета.Услуга.ВидУслуги,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ПоказаниеПредыдущее
	    |ИЗ
	    |	РегистрСведений.ПоказанияПриборовЗаМесяц.СрезПоследних(&НаДату, Здание.Наименование ПОДОБНО ""%"" + &Наименование + ""%"") КАК ПоказанияПриборовЗаМесяцСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.Здание,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ЛицевойСчет,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ОбъектЛицевогоСчета,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ЛицевойСчет.МобТелефон,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ЛицевойСчет.Бойлер,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ЛицевойСчет.НеЖивут,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ПриборУчета,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ПриборУчета.Услуга.ВидУслуги,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ПоказаниеПредыдущее,
	    |	ПоказанияПриборовЗаМесяцСрезПоследних.ОтветственныйВладелец
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	Здание,
	    |	ЛицевойСчет
	    |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("Наименование", Отчет.Адрес);
	Запрос.УстановитьПараметр("НаДату", Отчет.НачалоПериода);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Колонки.Добавить("МесяцНачисления");
	РезультатЗапроса.Колонки.Добавить("Начислено");
	РезультатЗапроса.Колонки.Добавить("Оплачено");
	РезультатЗапроса.Колонки.Добавить("Остаток");
	НачисленияЛС(РезультатЗапроса);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	ТабДок = Новый ТабличныйДокумент;
	СформироватьОтчетНаСервере1(ТабДок);
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура НачисленияЛС(тз)
	Для Каждого стр Из тз Цикл
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ВыбратьНачисления(МесяцНачисления, ЛицевойСчет, Услуга)
	
КонецФункции
